thesis/listings/streaming-message-error.xml

<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://www.w3.org/2005/08/addressing"
    xmlns:stream="https://github.com/autermann/streaming-wps"
    xmlns:ows="http://www.opengis.net/ows/1.1">
    <soap:Header>
        <wsa:RelatesTo>uuid:6a0e50c7-85c4-448c-962d-894c41c441bf</wsa:RelatesTo>
        <wsa:MessageID>uuid:dc640a0a-d505-4591-baea-2a556412237e</wsa:MessageID>
        <wsa:Action>https://github.com/autermann/streaming-wps/error</wsa:Action>
    </soap:Header>
    <soap:Body>
        <stream:ErrorMessage>
            <stream:ProcessID>uuid:c99e6f21-f0a0-4770-9615-db3501490f0a</stream:ProcessID>
            <ows:Exception exceptionCode="RemoteComputationError">
                <ows:ExceptionText>Remote computation failed</ows:ExceptionText>
            </ows:Exception>
        </stream:ErrorMessage>
    </soap:Body>
</soap:Envelope>